package arraydemo;

public class ArrayDemo1 {
    static void main() {
        //格式：
        //静态初始化
        //完整格式：
        //数据类型 [] 数组名 = new 数据类型 [] {元素1,元素2,元素3,元素4,元素5};
        //简化格式：
        //数据类型 [] 数组名 = {元素1,元素2,元素3,元素4,元素5};
        //需求1：定义数组储存五个学生的年龄
        /* int [] arr1 =new int []{11,12,13,14,15};
        int [] arr2 = {11,12,13,14,15};
        //需求2：定义数组储存五个学生的姓名
        String [] arr3 = new String []{"张三","李四","王五","赵六","钱七"};
        String [] arr4 = {"张三","李四","王五","赵六","钱七"};*/
        //需求3：定义数组储存五个学生的身高
        double[] arr5 = new double[]{1.74, 1.81, 1.93, 1.68, 1.59};
        double[] arr6 = {1.74, 1.81, 1.93, 1.68, 1.59};
        System.out.println(arr5);//[D@f6f4d33

        //扩展
        //解释一下地址值的格式含义[D@f6f4d33
        //[：表示当前是一个数组
        //D：表示当前数组里面的元素是double类型的
        //@：表示一个间隔符号（固定格式）
        //f6f4d33：表示当前数组的地址值(十六进制)
        //平时我们习惯性的把这个整体叫做数组的地址值
    }
}
